
function flowS1Can() {
    //mfs.length = 0;
    //var type = $.trim(type);
    //var num = Number(num);
    crflow(28, 103, 162, 124); //流入水箱	
    crflow(369, 212, 541, 241); //水箱流出到泵组

    crflow(479, 363, 426, 458); //流入泵1的横管	
    crflow(525, 283, 480, 362); //流入泵2的横管	
    crflow(548, 245, 528, 277); //流入泵3的横管	
    crflow(550, 244, 570, 207); //流入泵4的横管	
    crflow(569, 210, 608, 141); //流入泵5的横管	
    crflow(608, 142, 641, 83); //流入泵6的横管	

    crflow(425, 471, 652, 519); //泵1的竖管	
    crflow(481, 370, 696, 412); //泵2的竖管	
    crflow(534, 284, 731, 319); //泵3的竖管	
    crflow(574, 208, 761, 238); //泵4的竖管	
    crflow(613, 141, 790, 168); //泵5的竖管	
    crflow(646, 82, 811, 105); //泵6的竖管	

    crflow(663, 519, 702, 414); //泵1流出的横管	
    crflow(702, 415, 738, 319); //泵2流出的横管	
    crflow(738, 321, 752, 282); //泵3流出的横管	
    crflow(768, 241, 752, 280); //泵4流出的横管	
    crflow(795, 171, 768, 240); //泵5流出的横管	
    crflow(817, 110, 795, 170); //泵6流出的横管	

    crflow(753, 297, 959, 333); //流出1	
    crflow(763, 266, 970, 300); //流出2	

    
}

